/*
https://www.acmicpc.net/problem/17295

&Title
17295번 - 엔드게임 스포일러

&Question
《어벤져스: 엔드게임》(영어: Avengers: Endgame)은 2019년 개봉한 미국의 슈퍼히어로 
영화로, 마블 코믹스의 동명 팀을 원작으로 하고 있으며, 마블 
스튜디오가 제작하고, 월트 디즈니 스튜디오스 모션 픽처스가 배급하였다. 이 
영화는 2012년 영화 어벤져스와, 2015년 영화 어벤져스: 에이지 오브 
울트론, 2018년 영화 어벤져스: 인피니티 워의 속편이자, 마블 시네마틱 
유니버스 (MCU)의 22번째 작품에 해당한다. 앤서니 루소와 조 루소가 
감독하고 크리스토퍼 마커스와 스티븐 맥필리가 공동으로 각본을 썼으며, 이전의 
MCU 영화에보다도 많은 배우와 앙상블 캐스트들이 등장한다.그래서 욱제는 이 
문제에서 엔드게임 스포일러를 하려고 한다. 

&Input
어벤져스: 엔드게임의 줄거리가 주어진다. 

&Output
어벤져스: 엔드게임의 영문 표기를 출력한다. 

&Example
-input
타노스가 전 우주의 모든 생명체 절반을 제거하기 위해 인피니티 건틀렛을

-output
문제의 답을 출력한다.


*/

/*
#include <iostream>
using namespace std;

int main() {
	ios::sync_with_stdio(false);
	cout << "Avengers: Endgame" << endl;
	return 0;
}
*/