/*
https://www.acmicpc.net/problem/18096

&Title
18096번 - Арифметическая магия

&Question
Дэвид Блейн попросил зрителя задумать два числа. Затем 
он попросил перемножить два числа, большие каждого из задуманных 
на единицу, вычесть из результата сначала одно задуманное число, 
затем другое, а затем --- их произведение, а полученный 
результат возвести в $N$-ю степень.После чего Дэвид внимательно вгляделся 
в лицо зрителя и правильно назвал получившийся результат. Ваша 
задача --- повторить фокус Дэвида. По заданному $N$ угадайте 
получившееся у зрителя число. 

&Input
Входные данные содержат одно целое число $N$ ($0 
\le N \le 1000$). 

&Output
Выведите одно число --- получившийся у зрителя результат. 


&Example
-input
3

-output
1


*/

/*
#include <iostream>
using namespace std;

int n;
int main() {
	ios::sync_with_stdio(false);
	cin >> n;
	cout << 1 << endl;
	return 0;
}
*/