/*
https://www.acmicpc.net/problem/2447

&Title
2447번 - 별찍기 - 10

&Question
예제를 보고 별찍는 규칙을 유추한 뒤에 별을 찍어 
보세요. 

&Input
첫째 줄에 N이 주어진다. N은 항상 3의 제곱꼴인 
수이다. (1, 3, 9, 27, ...) (N=3^k, 0<=k<8) 

&Output
첫째 줄부터 N번째 줄까지 별을 출력한다. 

&Example
-input
27
-output
***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************
*********         *********
* ** ** *         * ** ** *
*********         *********
***   ***         ***   ***
* *   * *         * *   * *
***   ***         ***   ***
*********         *********
* ** ** *         * ** ** *
*********         *********
***************************
* ** ** ** ** ** ** ** ** *
***************************
***   ******   ******   ***
* *   * ** *   * ** *   * *
***   ******   ******   ***
***************************
* ** ** ** ** ** ** ** ** *
***************************

*/

/*
#include <iostream>
using namespace std;

void draw(int dy, int dx) {
	while (dy != 0) {
		if (dy % 3 == 1 && dx % 3 == 1) { 
			//몫을 3으로 나누었을때 나머지가 둘다 나머지 1일때
			printf(" ");
			return;
		}
		dy /= 3;  //3으로 나누어 몫을 만든다.
		dx /= 3;
	}
	printf("*");
}

int main() {
	int N;
	cin >> N;
	for (int y = 0; y < N; y++) {
		for (int x = 0; x < N; x++) {
			draw(y, x);
		}
		cout << endl;
	}
	return 0;
}
*/