/*
https://www.acmicpc.net/problem/9653

&Title
9653번 - 스타워즈 로고

&Question
스타워즈 로고를 예제 출력과 같이 출력하는 프로그램을 작성하시오. 


&Input


&Output
스타워즈 로고를 출력한다. 

&Example
-input

-output
    8888888888  888    88888
   88     88   88 88   88  88
    8888  88  88   88  88888
       88 88 888888888 88   88
88888888  88 88     88 88    888888

88  88  88   888    88888    888888
88  88  88  88 88   88  88  88
88 8888 88 88   88  88888    8888
 888  888 888888888 88  88      88
  88  88  88     88 88   88888888


*/

/*
#include <iostream>
using namespace std;

int main() {
	ios::sync_with_stdio(false);
    cout << "    8888888888  888    88888\n   88     88   88 88   88  88\n    8888  88  88   88  88888\n       88 88 888888888 88   88\n88888888  88 88     88 88    888888\n\n88  88  88   888    88888    888888\n88  88  88  88 88   88  88  88\n88 8888 88 88   88  88888    8888\n 888  888 888888888 88  88      88\n  88  88  88     88 88   88888888" << endl;
	return 0;
}
*/